grupo13_github/grupo13/app/controllers/platos_controller.rb

SELECT "platos".* FROM "platos"
---
    def index
        @platos = Plato.all