grupo13_github/grupo13/app/controllers/restaurantes_controller.rb

  def index
    @restaurantes = Restaurante.all
---
SELECT "restaurantes".* FROM "restaurantes"

  def show
    @restaurantes = Restaurante.find(params[:id])
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @restaurante = Restaurante.create(restaurante_params)
    if @restaurante.save
---
INSERT INTO "restaurantes" ("created_at", "updated_at", "titulo", "correo", "direccion", "valoracion", "telefono", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "restaurantes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-09-29 14:03:22.732639"], ["updated_at", "2019-09-29 14:03:22.732639"]]

  def destroy
    @restaurante.destroy
---
DELETE FROM "restaurantes" WHERE "restaurantes"."id" = $1  [["id", 1]]

    def set_restaurante
      @restaurante = Restaurante.find(params[:id])
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]