grupo13/app/controllers/comentarios_controller.rb

SELECT "comentarios".* FROM "comentarios"
---
  def index
    @comentarios = Comentario.all

INSERT INTO "comentarios" ("restaurante_o_plato", "usuario", "fecha_y_hora", "contenido", "puntaje_de_reputacion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @comentario = Comentario.new(comentario_params)

    respond_to do |format|
      if @comentario.save

SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_comentario
      @comentario = Comentario.find(params[:id])