grupo13/app/controllers/ordenes_controller.rb

  def index
    @ordenes = Ordene.all
---
SELECT "ordenes".* FROM "ordenes"

  def create
    @ordene = Ordene.new(ordene_params)

    respond_to do |format|
      if @ordene.save
---
INSERT INTO "ordenes" ("platos_pedidos_en_la_orden", "precio_final_a_pagar", "medio_de_pago", "direccion_de_envio", "hora_estimada_de_entrega", "estado_del_pedido", "notas", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    @ordene.destroy
---
DELETE FROM "ordenes" WHERE "ordenes"."id" = $1  [["id", 1]]

    def set_ordene
      @ordene = Ordene.find(params[:id])
---
SELECT  "ordenes".* FROM "ordenes" WHERE "ordenes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]