grupo13/app/controllers/platos_controller.rb

SELECT "platos".* FROM "platos"
---
  def index
    @platos = Plato.all

INSERT INTO "platos" ("nombre", "precio", "descripcion", "cantidad_de_personas_sugeridas", "valoracion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @plato = Plato.new(plato_params)

    respond_to do |format|
      if @plato.save

SELECT  "platos".* FROM "platos" WHERE "platos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_plato
      @plato = Plato.find(params[:id])