grupo13/app/controllers/restaurantes_controller.rb

  def index
    @restaurantes = Restaurante.all
---
SELECT "restaurantes".* FROM "restaurantes"

  def show
    puts 'DALE CARAJO'
    @restaurantes = Restaurante.find(params[:id])
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def edit
    @restaurantes = Restaurante.find(params[:id])
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    puts('1234556778888a88as8888')
    puts(restaurante_params)
    puts(params[:restaurante])
    puts('1234556778888a88as8888')
    @restaurantes = Restaurante.new(params[:restaurante].permit(:titulo, :correo, :direccion, :valoracion, :telefono, :url))
    if @restaurantes.save
---
INSERT INTO "restaurantes" ("created_at", "updated_at", "titulo", "correo", "direccion", "valoracion", "telefono", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @restaurantes.destroy
---
DELETE FROM "restaurantes" WHERE "restaurantes"."id" = $1  [["id", 1]]

    def set_restaurante
      @restaurantes = Restaurante.find(params[:id])
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]