app/controllers/comentarios_controller.rb

SELECT "comentarios".* FROM "comentarios"
---
  def index
    @comentarios = Comentario.all

SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @comentarios = Comentario.where(:id => params[:id])
    if @comentarios.exists?

INSERT INTO "comentarios" ("restaurante_o_plato", "usuario", "fecha_y_hora", "contenido", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @comentario = Comentario.new(comentario_params)

    respond_to do |format|
      if @comentario.save

DELETE FROM "comentarios" WHERE "comentarios"."id" = $1  [["id", 3]]
---
  def destroy
    @comentarios.destroy

SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_comentario

      @comentarios = Comentario.find(params[:id])