app/controllers/ordenes_controller.rb

SELECT "ordenes".* FROM "ordenes"
---
  def index
    @ordenes = Ordene.all

SELECT  "ordenes".* FROM "ordenes" WHERE "ordenes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "ordenes" WHERE "ordenes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @ordenes = Ordene.where(:id => params[:id])
    if @ordenes.exists?

INSERT INTO "ordenes" ("platos_pedidos_en_la_orden", "precio_final_a_pagar", "medio_de_pago", "direccion_de_envio", "hora_estimada_de_entrega", "estado_del_pedido", "notas", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @ordene = Ordene.new(ordene_params)

    respond_to do |format|

    #  if @ordene.aceptar

        if @ordene.save

DELETE FROM "ordenes" WHERE "ordenes"."id" = $1  [["id", 1]]
---
  def destroy
    @ordene.destroy

SELECT  "ordenes".* FROM "ordenes" WHERE "ordenes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_ordene
      @ordene = Ordene.find(params[:id])