app/controllers/platos_controller.rb

SELECT "platos".* FROM "platos"
---
  def index
    @platos = Plato.all

SELECT  "platos".* FROM "platos" WHERE "platos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "platos" WHERE "platos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "platos".* FROM "platos" WHERE "platos"."id" = $1  [["id", 2]]
---
  def show
    @platos = Plato.where(:id => params[:id])
    if @platos.present?

SELECT  "platos".* FROM "platos" WHERE "platos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @plato = Plato.find(params[:id])

INSERT INTO "platos" ("created_at", "updated_at", "nombre", "descripcion") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-12-08 02:06:03.799960"], ["updated_at", "2019-12-08 02:06:03.799960"], ["nombre", "plato 11"], ["descripcion", ""]]
---
  def create
    @plato = Plato.new(plato_params)

    respond_to do |format|
      if @plato.save

UPDATE "platos" SET "nombre" = $1, "updated_at" = $2 WHERE "platos"."id" = $3  [["nombre", "plato 11"], ["updated_at", "2019-12-08 00:09:55.726562"], ["id", 15]]
---
  def update
    puts('---------------------------')
    respond_to do |format|
      puts('------------------###--------')

      if @platos.update(plato_params)

DELETE FROM "platos" WHERE "platos"."id" = $1  [["id", 6]]
---
  def destroy
    @platos.destroy

SELECT  "platos".* FROM "platos" WHERE "platos"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def set_plato
      @platos = Plato.find(params[:id])