app/controllers/restaurantes_controller.rb

  def index
    @restaurantes = Restaurante.all
---
SELECT "restaurantes".* FROM "restaurantes"

  def show
    @restaurantes = Restaurante.find(params[:id])
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @restaurante = Restaurante.find(params[:id])
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    puts('1234556778888a88as8888')
    puts(restaurante_params)
    puts(params[:restaurante])
    puts('1234556778888a88as8888')
    @restaurantes = Restaurante.new(params[:restaurante].permit(:titulo, :correo, :direccion, :valoracion, :telefono, :url, :avatar))
    if @restaurantes.save
---
INSERT INTO "restaurantes" ("created_at", "updated_at", "titulo", "correo", "direccion", "telefono", "url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2019-12-08 00:41:38.707987"], ["updated_at", "2019-12-08 00:41:38.707987"], ["titulo", "1"], ["correo", "1@1.cl"], ["direccion", ""], ["telefono", ""], ["url", ""]]

  def update
    puts('---------------------------')
    respond_to do |format|
      if @restaurantes.update(restaurante_params)
---
UPDATE "restaurantes" SET "titulo" = $1, "url" = $2, "updated_at" = $3 WHERE "restaurantes"."id" = $4  [["titulo", "jhgkh1"], ["url", "nvhb"], ["updated_at", "2019-12-03 22:50:46.588350"], ["id", 1]]

  def destroy
    @restaurantes.destroy
---
DELETE FROM "restaurantes" WHERE "restaurantes"."id" = $1  [["id", 1]]

    def set_restaurante
      @restaurantes = Restaurante.find(params[:id])
---
SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]